# ElementId Constructor (BuiltInParameter) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementId Constructor (BuiltInParameter)
ElementId Class See Also
---
Create an ElementId handle with the given BuiltInParameter id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId(
	BuiltInParameter parameterId
)
```

Visual Basic
---
```text
Public Sub New ( _
	parameterId As BuiltInParameter _
)
```

Visual C++
---
```text
public:
ElementId(
	BuiltInParameter parameterId
)
```

# ### Parameters
parameterId
    Type: Autodesk.Revit.DB..::..BuiltInParameterThe id.
# See Also
ElementId Class
ElementId Overload
Autodesk.Revit.DB Namespace